# üìå Pandas Assignment

In [1]:
import pandas as pd

## 1Ô∏è‚É£ Create DataFrame and Perform Operations

In [2]:
# Creating the DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [24, 27, 22, 32, 29],
    'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
    'Salary': [45000, 54000, 50000, 62000, 47000]
}
df = pd.DataFrame(data)
df

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

### 1(a) Display first five rows

In [3]:
df.head()

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

### 1(b) Summary statistics of 'Age' and 'Salary'

In [4]:
df[['Age', 'Salary']].describe()

             Age        Salary
count   5.000000      5.000000
mean   26.800000  51600.000000
std     3.962323   6730.527468
min    22.000000  45000.000000
25%    24.000000  47000.000000
50%    27.000000  50000.000000
75%    29.000000  54000.000000
max    32.000000  62000.000000

### 1(c) Average salary of employees in HR department

In [5]:
df[df['Department'] == 'HR']['Salary'].mean()

np.float64(46000.0)

## 2Ô∏è‚É£ Add Bonus Column

In [6]:
df['Bonus'] = df['Salary'] * 0.10
df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

## 3Ô∏è‚É£ Filter employees aged between 25 and 30

In [7]:
filtered_df = df[(df['Age'] >= 25) & (df['Age'] <= 30)]
filtered_df

  Name  Age Department  Salary   Bonus
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

## 4Ô∏è‚É£ Group by Department ‚Äî Average Salary

In [8]:
department_avg = df.groupby('Department')['Salary'].mean()
department_avg

Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

## 5Ô∏è‚É£ Sort by Salary and Save to CSV

In [9]:
sorted_df = df.sort_values(by='Salary', ascending=True)
sorted_df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0

In [13]:
sorted_df.to_csv('sorted_employees.csv', index=False)